{"title":"Bo Ssam","template":"recipe.mustache","time":"7 hours","makes":"10 servings","ingredients":["1 whole bone-in pork butt **(8 to 10 pounds)**","1 cup white sugar","1 cup plus 1 tablespoon kosher salt","7 tablespoons brown sugar","5 cups thinly sliced scallions, both green and white parts","1 cup peeled, minced fresh ginger","1 cup neutral oil **(like grapeseed)**","0.5 cup sherry vinegar","3 teaspoons light soy sauce","2 tablespoons fermented bean-and-chili paste **(ssamjang)**","1 tablespoon chili paste **(kochujang)**","5 cups sushi rice","Kimchi","lettuce wraps **(bibb lettuce or radicchio)**"],"steps":["Place the pork in a large, shallow bowl. Mix the white sugar and 1 cup of the salt together in another bowl, then rub the mixture all over the meat. Cover it with plastic wrap and place in the refrigerator for at least 6 hours, or overnight.","When you're ready to cook, heat oven to 300. Remove pork from refrigerator, brush any excess sugar mixture off the fat cap and discard any juices. Place the pork in a roasting pan and set in the oven and cook for approximately 6 hours, or until it collapses, yielding easily to the tines of a fork. **(After the first hour, baste hourly with pan juices.)**","Remove the meat from the oven and allow it to rest for up to an hour.","Meanwhile, make the ginger-scallion sauce. In a bowl, combine the scallions with the ginger, 0.5 cup of neutral oil, 3 teaspoons light soy sauce, and 2 teaspoon sherry vinegar. Mix well and taste, adding salt if needed.","Also make the ssam sauce. In a bowl, combine the ssamjang and kochujang chili pastes with 0.5 cup of vinegar 0.5 cup of oil, and mix well.","Prepare rice, wash lettuce, and put kimchi in serving bowl","When your accompaniments are prepared and you are ready to serve the food, turn oven to 500. In a small bowl, stir together a tablespoon of salt with the 7 tablespoons of brown sugar. Rub this mixture all over the cooked pork. Place in oven for approximately 10 to 15 minutes, or until a dark caramel crust has developed on the meat. Serve hot, with the accompaniments."],"notes":["This is basically a korean twist on American BBQ... The shredded pork butt with bits of caramelized fat is like a delicious korean inspired pulled pork, with ssam sauce serving as as the BBQ sauce, Kimchi as the collard greens, and sushi rice as the mac and cheese.","Adding the sugar at the end and broiling it does a good enough job of simulating a bark, but makes the crust overly seasoned, such that it must be mixed in with the meat to be enjoyed.","The original recipe calls for far too little ginger scallion sauce, so this version of the recipe doubles the quantity.","This recipe makes great leftovers. I like to make extra rice, and then cut up the meat and make rice bowls with the extras. Probably you'll want to make *even more* sauce if you plan to do this."],"basedon":["[Momofukus Bo Ssam](https://cooking.nytimes.com/recipes/12197-momofukus-bo-ssam)"],"CORK_url":"bo-ssam.html","CORK_reading_time":1,"CORK_lix_readability_score":0,"CORK_ari_readability_score":0,"content":"\n"}