{"title":"Bourbon Infinity Bottle","template":"recipe.mustache","time":"A lifetime","makes":"Infinite servings","ingredients":["1.5oz Old Forester Signature (100 proof)","1.5oz Willett Pot Still Reserve","1.5oz Elijah Craig Small Batch","1.5oz Bulleit Bourbon","1.5oz Angels Envy","1.5oz Hudson Baby Bourbon","1oz 1792 Small Batch","1oz Jack Daniels","3oz Wild Turkey Rare Breed","2oz High West American Prairie Bourbon","3oz Old Ezra 7yr Barrel Strength","3oz Knob Creek 9yr","3oz Makers Mark 46","3oz Woodford Reserve Double Oaked","3oz Old Forester 1920 Prohibition Style","3oz Eagle Rare 10yr","3oz Old Forester 1910 Old Fine"],"steps":["Every time you buy a new bourbon, add a small amount to your infinity bottle","After adding to the infinity bottle, wait at least 12 hours before sampling the result **(to allow the flavors to marry)**","When you start to run out of space, drink down the existing juice to make room for more. This will alter the ratios of the constituent bourbon, but in traditional [Solera](https://en.wikipedia.org/wiki/Solera) style, a fraction of each will remain","Over time the infinity bottle will begin to take on its own character, which you can guide by the inclusion of bourbons with specific flavor profiles"],"notes":["**2017-06-12** Decided to start my own Bourbon infinity bottle","**2018-11-17** Tasted before adding the 1792, and it has a Bulliet backbone, but with notes of the Hudson Baby shining through. Most of the others are not noticeable, with maybe a hint of Old Forester","**2020-09-21** After quite some time away from bourbon, I have recently started drinking it as my nightcap, and as such have gone through a few new bottles. With the addition of the Woodford Reserve Double Oaked, the infinity bottle (750ml) is full. The Woodford comes through when I taste it, with some of the spice and heat of the Old Ezra, but it's getting pretty hard to tease out the constituent bourbons.","**2020-10-07** The Old Forester 1920 is coming through as the dominant note, but in a subdued sort of way that makes it more palatable than drinking it straight (likely because the overall mixture is lower proof than the 1920 by itself. Not sure if it's because that's what I recently added (although I did wait well over the recommended 12 hours before sampling it), and I didn't mix things around well enough, or just because that's what I've been drinking lately, and so my palate is acclimated to the flavor profile. Either way, the infinity bottle flavors continue to impress."],"basedon":["Lifelong bourbon exploration","[WineEnthusiast Whiskey Blending Guide](https://www.winemag.com/2018/06/25/whiskey-blending-guide/)","[Bourbon Family Tree](/assets/bourbon-family-tree.jpg)","[Whiskey Tasting Notes](/assets/whiskey-tasting-notes.jpg)"],"CORK_url":"bourbon-infinity-bottle.html","CORK_reading_time":1,"CORK_lix_readability_score":0,"CORK_ari_readability_score":0,"content":"\n"}