{"title":"Old Fashioned","template":"recipe.mustache","time":"2 minutes","makes":"1","ingredients":["2oz overproofed Bourbon or Rye Whiskey","1 teaspoon dark agave syrup","Dash of Angostora bitters","Pinch of salt","Orange peel"],"steps":["In a mixing glass combine whiskey, syrup, bitters, and salt","Fill with ice and stir until cold","Strain into a heavy bottomed old fashioned glass with a large ice cube","Express orange peel and rub around rim of glass before dropping it into the drink"],"notes":["Since I tend to like whiskey neat, I didn't like most old fashioneds, because they just seemed like a sweeter, watered down glass of whiskey. Using overproofed whiskey solves this issue, because the rest of the cocktail accentuates the flavors, while bringing it down to a more sippable proof.","Using agave syrup is a trick to get a better mouthfeel, because regular sugar or simple syrup doesn't have enough viscosity. Double strength simple syrup would likely achieve a similar result, but I prefer the flavor profile of the agave syrup.","The bitters and salt work as flavor enhancers **(bitters basically being the \"salt and pepper\" of most cocktails)**","The orange peel gives the drink a nice citrusy nose, and nicely complements the flavor of most bourbon and rye whiskey","The old fashioned is more a template than a specific cocktail, so it's relatively easy to riff on the general formula. Substituting rum, tequila, or some other base spirit is usually a straightforward way to produce a drinkable variation. The sweetening agent can also be substituted as necessary. The Godfather cocktail, for example is simply an Old fashioned with Scotch as the base spirit and amaretto as the sweetener. Oaxacan old fashioned is a similar template with tequila.","Using this old fashioned template with a peaty scotch as the base spirit, and amaretto as the sweetener results in a cocktail with a flavor profile reminiscent of an infused cigar."],"basedon":["Cocktail Codex","Personal old fashioned experimentation"],"CORK_url":"old-fashioned.html","CORK_reading_time":1,"CORK_lix_readability_score":0,"CORK_ari_readability_score":0,"content":"\n"}