{"title":"Steak Tartare","template":"recipe.mustache","time":"15 minutes","makes":"1 servings","ingredients":["~0.5lb filet mignon","Mayonnaise **(homemade preferred)**","Dijon Mustard","Worcester Sauce","Shallot","Capers","Cornichons/ Gherkins","Salt + Pepper","Cognac","1 Egg"],"steps":["Chill the filet and serving bowl in the freezer","While chilling, finely dice the shallot, capers, and pickles","Remove the chilled filet from the freezer, and slice into fine cubes","Return meat to freezer/ fridge","Once meat is re-chilled and you are ready to eat, mix with the shallot, capers, pickles, a few drops of Worcester sauce, a drizzle of Cognac, and a dollop of mayo and Dijon mustard.","Gently mix everything together, and season with salt and pepper to taste","Use a mold to form the tartare on a plate if desired, and top with an egg yolk","Serve and consume immediately"],"notes":["The ratio of the various ingredients to meat is mostly personal preference. I tend to use 1 shallot, a spoonful of capers, 3-4 pickles, a few drops of Worcester sauce **(even a few drops packs quite a punch)**, and a spoonful of mayo and mustard each, with a bit more mustard than mayo.","Don't forget to salt and pepper the tartare, or the flavor will be off","When slicing the beef, it's best to use a sharp knife and do it when the beef is still a little frozen **(and thereby firmer)**. Some people grind it in a meat grinder, but I prefer the hand-sliced texture. You're looking for finely diced meat... to much cutting and it will turn into a gooey paste, not enough cutting, and the cubes will be too large resulting in an overly chewy texture.","When mixing the tartare, don't be too forceful, or else the meat will start to bind together, ruining the texture of the final product.","Some people like to add other ingredients, common ones being Tabasco, Ketchup, vinegar **(or some other acid like lemon juice)**, herbs, etc. I prefer this simple version, but usually enjoy those variations as well. Generally speaking, as long as you don't overwhelm the underlying flavor of the meat, you can vary the flavors you add quite a lot.","Speaking of the flavor of the meat, using high quality beef is incredibly important here, not only because you are eating it raw, and so at higher risk of pathogens, but also because eaten in this form, the flavor of the raw beef comes through very powerfully. I particularly like using grass fed beef in this recipe.","A lot of tartare recipes will tell you to use a lean cut like sirloin or top round instead of the more expensive tenderloin, and while I'm not a fan of tenderloin when it comes to cooking steaks since other cuts like ribeye are much more flavorful, in a tartare, I find it to be the best choice. The soft, evenness of the meat, and subdued flavor profile work wonderfully well in this dish. **I would go so far as to say that tartare is the only time when paying the premium for tenderloin makes sense**. In a pinch though, I've had success with top sirloin, or even better, shoulder tender **(teres major)** if you can find it.","Some tartare recipes will skip the Worcester sauce, and instead call for anchovies, garlic, etc. There's no issue with going that route, but I've found that recreating the umami flavors of Worcester sauce with the singular ingredients isn't worth the effort in terms of the flavor profile of the finished product.","Do not skip the egg yolk... it is critical to bring together the flavors and richness of the tartare. I've heard that other yolks work well too, particularly duck yolk.","The cognac is sort of optional, but adds a certain enjoyable je ne sais quoi."],"basedon":["[Bistro Style Steak Tartare](https://www.newyorker.com/culture/kitchen-notes/how-to-make-a-classic-bistro-style-steak-tartare-at-home)","[Anthony Bourdain's Steak Tartare](https://www.bloomberg.com/news/articles/2020-06-19/anthony-bourdain-steak-tartare-recipe-use-your-knife-skills)","[Julien Ponthieu's Steak Tartare](https://www.youtube.com/watch?v=0krnooaNADk)","[Tasting Table best cuts for steak tartare](https://www.tastingtable.com/887572/the-absolute-best-cuts-of-meat-for-steak-tartare/)"],"CORK_url":"steak-tartare.html","CORK_reading_time":1,"CORK_lix_readability_score":0,"CORK_ari_readability_score":0,"content":"\n"}