{"title":"Stir Fry","template":"recipe.mustache","time":"30 minutes","makes":"2 servings","ingredients":["Protein **(steak, chicken, sausage, etc)**","Garlic","Ginger","2 veggies **(onion, carrot, snow pea, broccoli, etc)**","Rice","Soy sauce","High smoke point oil **(peanut, canola, etc)**","Corn starch","Rice wine **(or substitute)**","Stir fry sauce **(oyster sauce, etc)**","Toppings **(scallion, sesame seeds, peanuts, etc)**"],"steps":["Cut the protein into bite sized chunks and add to a bowl with oil, soy sauce, rice wine, corn starch, salt, pepper, and sugar. Mix roughly and set aside to marinate for 15-30 minutes.","Start the [rice cooking](/sushi-rice.html).","Finely mince or grate the desired amount of garlic and ginger and set aside.","Chop veggies into bite sided pieces and set aside.","Open windows, start your kitchen vent fan, and heat your wok on high until it is radiating heat.","Take the wok off the fire and add a healthy amount of oil, swirling it around to coat the cooking surface.","Return wok to medium fire, immediately adding aromatics **(ginger and garlic)**, and constantly stirring until lightly browned.","Add protein, continuing to stir [as well as toss](https://www.seriouseats.com/wok-skills-101-stir-frying-basics#toc-hand-skills-for-stir-frying) the food.","Once the meat is browned, add some rice wine (or other alcoholic spirit) to deglaze **(and flambe/ add a little extra wok hei)**.","Next, add the veggies, continuing to stir and toss until everything is cooked to your liking.","Pour your stir fry sauce **(or soy sauce if not using)** around the sides of the wok, allowing it to sear before mixing it in with the rest of the food.","Finally, remove from heat, and add any toppings.","Serve with the cooked rice."],"notes":["Stir fry in general is very adaptable to whatever protein and veggies you have on hand. As long as you have the essential aromatics, rice, and soy sauce, the other components can be swapped out as desired. [A stir fry template](assets/StirFryTemplate.webp) gives a visual example of the range of options.","The [basic meat marinade](https://www.seriouseats.com/basic-marinade-for-stir-fried-meats-recipe) works surprisingly well, adding a good base flavor to the protein. The corn starch acts as a light coating which protects the meat and helps prevent overcooking. Initially I thought I could skip this step, instead building flavor directly in the wok, but I found the meat to be significantly worse without marinating it like this first.","Basically all stir fry recipes use minced garlic and ginger as the base aromatics. I've found it easiest/ quickest to use a cleaver to smash the garlic and ginger after peeling, and then mince up the crushed contents.","On a related efficiency note, I was making stir fry for weekday dinner quite regularly for a while, and so optimizing for speed and ease of cleanup. I found that cutting the meat and marinating it first, then starting the rice, then washing and reusing the cutting board/ knife for the aromatics and veggies optimized prep time, parallelized cook time, and minimized dishes to wash.","Since the overall cooking time is relatively short, it's also important to have everything you plan to add ready to go. In addition to pre-cutting the food, I also like to use the ['wok clock' method](https://youtu.be/D_xL8TxxX2k?si=UTPZOc6rvUp88yVe&t=92) whereby I arrange cut food around a plate starting at 12 o'clock in the order that I'll be adding it to the stir fry.","Cleaning out the wok right after finishing the stir fry ensures nothing sticks, and usually means you can simply use hot water and a brush/ paper towel, further minimizing cleanup **(and reducing the need for soap or excessive scrubbing which is detrimental to the seasoning of the wok)**. After cleaning it, I like to put the wok back on the burner for a few minutes to dry it out and prevent rusting. If I noticed food was sticking during the cook, I'll also buff a thin layer of oil onto the heated wok and let it smoke off to increase the seasoning.","A characteristic flavor of stir fry is a slight smokey, caramelized note, which is called 'Wok Hei'. This is a result of the high heat style cooking method, combined with the tossing motion, which vaporizes some of the oils and fats being cooked, causing brief flare ups and singed caramelization reminiscent of the flame grilled flavor you get when cooking over charcoal. The flambe step above aims to enhance those notes, since it is often difficult to achieve proper wok hei on a residential burner, but an [alternative technique is to use a blowtorch](https://www.seriouseats.com/hei-now-youre-a-wok-star-a-fiery-hack-for-stir-frying-at-home).","When adding soy sauce, or whatever stir fry sauce you are using, it is important to pour it around the sides of the wok so that it has a chance to sear before mixing in with the rest of the cooking ingredients. If you instead were to dump it directly on top of the food in the wok, you would immediately cool down the food, and end up steaming it as the sauce heated up. Searing the sauce prevents steaming, and further contributes to the wok hei style flavors of the overall dish as the sauce itself caramelizes a bit before mixing with everything else.","If using vegetables which would benefit from pre-cooking before the actual stir fry **(eg. broccoli, cauliflower, etc)**, I like to boil some water directly in the wok and blanch/ steam them first. Then I place them at the appropriate hour on my wok clock, dump out the water, and proceed with the regular recipe. This keeps cleanup to a minimum, and ensures that everything cooks in a timely manner during the actual stir fry.","The super high heat of wok cooking locks in moisture and juices in the meat and veggies, and gives them a unique, fresh taste and texture. To manage that high heat and avoid burning, however, you have to remain very diligent. This means intelligently choosing the order of your cook **(ie. wok clock)**, and removing cooked components from the wok as you add new ones in if necessary. An additional technique I've found useful is to push earlier food up the sides of the wok to regulate their exposure to the highest heat, adding new food directly to the center, letting it cook, and then mixing it in with the earlier food.","Given the desire for high heat, it is also important to keep your ingredients as externally dry as possible, to avoid inadvertently steaming the food. If using defrosted frozen vegetables, for instance, I try to drain and pat them dry prior to adding them to the wok."],"basedon":["[The Wok: Recipes and Techniques](https://thewokbook.com/)","[Stir Fry Template](assets/StirFryTemplate.webp)","[Serious Eats Wok Skills 101](https://www.seriouseats.com/wok-skills-101-stir-frying-basics)","[Serious Eats basic stir fry marinade](https://www.seriouseats.com/basic-marinade-for-stir-fried-meats-recipe)","[School of Wok](https://schoolofwok.co.uk/) [Youtube recipes](https://www.youtube.com/channel/UCBrxd1Mum2cYH7DOxo2exJA)","[Serious Eats - The Wok](https://www.seriouseats.com/the-wok-digital-issue-5218092)"],"CORK_url":"stir-fry.html","CORK_reading_time":1,"CORK_lix_readability_score":0,"CORK_ari_readability_score":0,"content":"\n"}